from telethon.events import NewMessage


async def init(bot):
  @bot.on(NewMessage(pattern=r'[Hh][Ee][Ll][Pp]|راهنما', outgoing=True))
  async def help_message(event):
    text = '''
        **راهنمای سلف حاکم**
        **help | راهنما**
        `نمایش پیام راهنما`
        ------------------
        **ping**
        `اطلاع از روشن بودن سلف`
        ------------------
        **dl (with reply)**
        `دانلود فایل های ارسال شده در چت حتی تایمر دار (روی پیام مورد نظر ریپلای شود)`
        ------------------
        **plugins**
        `نمایش پلاگین های نصب شده`
        ------------------
        **pr (username of chat)**
        `دریافت تمامی فایل های ارسال شده در چت مورد نظر`
        ------------------
        **yt (youtube link)**
        `دانلود لینک یوتیوب موردنظر بصورت mp3`
        ------------------
        **run (command)**
        `اجرای دستور مورد نظر در ترمینال`
        ------------------
        **sms (number)**
        `اس ام اس بمبر (شماره بدون صفر و پیش شماره وارد شود)`
        '''
    await event.edit(text)
